Merge pull request #2 from emphereio/tests
Tests
